import { browserLocale } from './helper';
import { ICONS, IMAGES } from "../assets";

const langBrowser = browserLocale();

const Store = {

    //язык сайта
    lang: langBrowser === "ru" ? true : false,

    //модальное окно открыто/закрыто
    modalGallery: false,
    modalBlog: false,
    contentCurrentBlog: [],
    modalForm: false,

    ua: {
        //heder
        logoSite: `Садиба "У Якова"`,
        message: "Надіслати повідомлення",
        phone: "+3807610748",
        nav: [
            {text: "Про нас", link: "/#about"},
            {text: "Номери", link: "/#numbers"},
            {text: "Галерея", link: "/#gallery"},
            {text: "Контакти", link: "/#contact"},
        ],
        service: [
            {
                src: ICONS.ROOM, 
                title: "Проживання", 
                text: "Комфортабельні 2-місні номери класу 'Стандарт' та 'Напівлюкс' з видом на гори.",
            },
            {
                src: ICONS.FOOD, 
                title: "Їдальня", 
                text: "Є обладнане всім необхідним приміщення для прийому та приготування їжі.",
            },
            {
                src: ICONS.SAUNA, 
                title: "Сауна та чан", 
                text: "На території готелю є чан з душем і залом для приємного проведення часу.",
            },
        ],
        gallery: [
            {
                src: IMAGES.GALLERY.GALLERY_1, 
                title: "Кадиба для приготування їжі на відкритому вогні.",
            },
            {
                src: IMAGES.GALLERY.GALLERY_2, 
                title: "Екстер'єр готелю з боку прилеглої території.",
            },
            {
                src: IMAGES.GALLERY.GALLERY_3, 
                title: "Відпочинковий зал біля чана.",
            },
            {
                src: IMAGES.GALLERY.GALLERY_4, 
                title: "Типовий інтер'єр одного із номерів класу 'Стандарт'.",
            },
        ],
        aboutTitle: "Відпочинок у нашому готелі – гарантія гарного настрою!",
        aboutText: "Готель розташований в долині в оточенні найкрасивіших гір. Гори вкриті густою рослинністю, і це гарантує чисте цілюще повітря. У кроковій доступності є магазини з необхідними на кожен день товарами та продуктами харчування. У годині їзди знаходиться перлина українських карпат – Буковель.",
        aboutImg: [
            {
                src: IMAGES.ABOUT.MYKULYCHYN, 
                title: "Прекрасний вид на Микуличин.",
            },
            {
                src: IMAGES.ABOUT.MYKULYCHYN_GERB, 
                title: "Герб Микуличина.",
            },
            {
                src: IMAGES.ABOUT.MYKULYCHYN_PRAPOR, 
                title: "Прапор Микуличина.",
            },
        ],
        review: [
            {
                title: "Готель чарівний.", 
                text: "Готель просто чарівний, дуже чистий, стильний, сучасний та затишний. Необхідні предмети гігієни є. Персонал доброзичливий.", 
                img: IMAGES.REVIEW.REVIEW_1, 
                auhtor: "Микола, Харків",
            },
            {
                title: "Затишно та чисто.", 
                text: "Фото відповідають. Дуже затишно та чисто. Кімната була невелика, але до цього можна звикнути. Дуже подобається розташування.", 
                img: IMAGES.REVIEW.REVIEW_2, 
                auhtor: "Поліна, Київ",
            },
            {
                title: "Комфортні номери.", 
                text: "Фото відповідають. Дуже затишно та чисто. Кімната була невелика, але до цього можна звикнути. Дуже подобається розташування.", 
                img: IMAGES.REVIEW.REVIEW_3, 
                auhtor: "Ярослав, Херсон",
            },
            {
                title: "Ідеальне місце.", 
                text: "Місце розташування ідеальне біля підніжжя гір! Залишилася під враженням, начебто в гостях у рідних! Прогулянки насолоду.", 
                img: IMAGES.REVIEW.REVIEW_4, 
                auhtor: "Ольга, Вінниця",
            },
            {
                title: "Ми в захваті.", 
                text: "Ми в захваті все сподобалося. Проживання не в центрі, а трішки на околиці села, але особисто для мене це величезний плюс.", 
                img: IMAGES.REVIEW.REVIEW_5, 
                auhtor: "Світлана, Хмельницький",
            },
            {
                title: "Відмінно.", 
                text: "Відмінне розташування і номер з видом на гори. Прекрасно підходить для віддаленої роботи, стабільний та дуже смачна їжа.", 
                img: IMAGES.REVIEW.REVIEW_6, 
                auhtor: "Вікторія, Кіровоград",
            },
            {
                title: "Дуже приємні ціни.", 
                text: "Чистота бездоганна. Хороше місце розташування. Є де поставити машину. Гарний вид із вікна, поряд гори – можна прогулятися.", 
                img: IMAGES.REVIEW.REVIEW_7, 
                auhtor: "Геннадій, Чернігів",
            },
            {
                title: "Сімейний відпочинок.", 
                text: "Красиві дерев'яні будинку. Кімнати чисті, затишні, ліжко зручне. Чудово обладнана зона відпочинку, є місце для шашлику.", 
                img: IMAGES.REVIEW.REVIEW_8, 
                auhtor: "Ольга, Полтава",
            },
            {
                title: "Завітаємо ще.", 
                text: "Дійсно дуже вдале розташування до локацій поблизу. Гори, долини, річка під боком. Обов'язково завітаємо ще неодноразово.", 
                img: IMAGES.REVIEW.REVIEW_9, 
                auhtor: "Петро, Миколаїв",
            },
        ],
        
        numbersTitle: "Номери для проживання",
        numbersText: `«Садиба У Якова» розташована у селищі Микуличин Івано-Франківської області. У Микуличині зручно зупинятися, якщо ваша мета — подивитися Карпати, так само тут варять чудове пиво! Чисте повітря, красива природа, безліч піших маршрутів мальовничими Карпатами, прийнятні ціни на проживання та в межах годинної доступності гірськолижні курорти Буковель та Яремче. Все це привід відвідати Микуличин та нашу садибу.`,
        numbers: [
            {
                title: "Стандарт",
                img: IMAGES.NUMBERS.STANDART,
                icon: [
                    {
                      img: ICONS.APARTMENTS,
                      text: "Апартаменти",
                    },
                    {
                        img: ICONS.HIKING,
                        text: "Вид на гори",
                    },
                    {
                        img: ICONS.FOOD,
                        text: "Їдальня та кухня",
                    },
                    {
                        img: ICONS.WI_FI,
                        text: "Безкоштовний Wi-Fi",
                    },
                    {
                        img: ICONS.PARKING,
                        text: "Безкоштовне паркування",
                    },
                ],
                description: `У номерах "Стандарт" є 2-х спальне ліжко, телевізор з супутниковими каналами, шафа для речей, 2 тумбочки, журнальний столик з 2-ма пуфами. Ванна кімната, туалет та холодильник розташовані на поверсі – 1 на 3 номери.`,
            },
            {
                title: "Напівлюкс",
                img: IMAGES.NUMBERS.JUNIOR_SUITE,
                icon: [
                    {
                        img: ICONS.APARTMENTS,
                        text: "Апартаменти",
                    },
                    {
                        img: ICONS.HIKING,
                        text: "Вид на гори",
                    },
                    {
                        img: ICONS.FOOD,
                        text: "Їдальня та кухня",
                    },
                    {
                        img: ICONS.WI_FI,
                        text: "Безкоштовний Wi-Fi",
                    },
                    {
                        img: ICONS.PARKING,
                        text: "Безкоштовне паркування",
                    },
                    {
                        img: ICONS.SHOWER,
                        text: "Власна ванна кімната",
                    },
                ],
                description: `У номерах "Напівлюкс" є 2-х спальне ліжко, телевізор з супутниковими каналами, холодильник, шафа для речей, 2 тумбочки, журнальний столик з 2-ма пуфиками і ванна кімната з душем.`,
            },
        ],
        blog: [
            {
                title: "Природна краса Микуличина",
                img: IMAGES.CAROUSEL.CAROUSEL_2,
                content: [
                    {
                        h2: "Водоспад Женецький Гук",
                        img: IMAGES.BLOG.WATERFALL,
                        p: "Один із найвищих карпатських водоспадів – його висота 15 м, а сам він знаходиться на висоті близько 900 м над рівнем моря. Від села Микуличин до водоспаду – 8 км, і щоб дістатися до нього, треба сісти на будь-який рейсовий автобус та вийти перед поворотом на Гук. Далі дорогу вкажуть покажчики. Перейшовши залізничні колії ви побачите контрольно-пропускний пункт, де потрібно буде сплатити прохід до водоспаду (з дорослої близько 10 грн, за дитину – дешевше, за проїзд автотранспорту стягується окрема плата). Далі асфальтовою дорогою доведеться йти 1-1,5 години, потім дорога зміниться на грунтовку. Весь маршрут промаркований, головне йти за вказівниками. Неподалік водоспаду розташувався сувенірний ринок, де можна купити карпатські трав'яні чаї, випити глінтвейн або гарячу каву, що особливо приємно в холодну пору. У водоспаду є альтанки та лавки, обладнані оглядові майданчики з драбинками та поручнями, поряд знаходиться невелике кафе-колиба. Місце користується популярністю у туристів у будь-яку пору року, тому їхати до водоспаду бажано раніше, щоб встигнути насолодитися природою в тиші.",
                    },
                    {
                        h2: "Гора Костел",
                        img: IMAGES.CAROUSEL.CAROUSEL_2,
                        p: "Розташована за 4,5 км на схід від Микуличина. Підйом можна розпочати від автомобільного мосту через річку Прутець Чемиговський. Вершину гори вінчає велика скеля з плоским верхом в оточенні дрібнішого каміння. На гору можна піднятися самостійно або замовити тур на позашляховику практично до вершини (такі екскурсії пропонують у готелях та садибах).",
                    },
                    {
                        h2: "Гора Ягідна",
                        img: "",
                        p: "Дорога, що веде до неї, починається прямо від автобусної зупинки. Підйом нескладний, без крутих ділянок. До вершини Ягідної йти години 2-3, але це того варте – з вершини відкривається шикарний краєвид на Чорногорський хребет. На вершині Ягідної є альтанка - можна відпочити, перекусити і вдосталь милуватися краєвидами, що відкриваються.",
                    },
                    {
                        h2: "Гора Маковиця.",
                        img: "",
                        p: "То одна з найвищих гір Яремче. Шлях займе 1,5-2 години. Центральною вулицею треба буде пройти у бік вулиці Гірської і далі у бік Маковиці. На її вершині стоїть металевий хрест, а при сходженні можна побачити окопи та знайти гільзи – сліди минулих війн.",
                    },
                    {
                        h2: "Гори Хом'як та Синяк.",
                        img: "",
                        p: "Похід подужать і новачки, і діти, тому що перепад висот невеликий, а на дорогах немає особливих перешкод. Один із маршрутів на м. Хом'як пролягає дорогою до водоспаду Женецький Гук (треба повернути ліворуч від КПП і йти пішки ще 8 км, маршрут має червоно-біле маркування).",
                    },
                ],
            },
            {
                title: "Сауна з бадьорим басейном",
                img: IMAGES.BLOG.SAUNAS,
                content: [
                    {
                        h2: "Чим корисно ходити до сауни?",
                        img: IMAGES.BLOG.SAUNAS,
                        p: "Після перебування у парній тонус м'язів знижується. Теплові дії знижують напругу в м'язах, пом'якшують сполучну тканину і роблять м'язи більш еластичними. Дія сауни на функцію зовнішнього дихання. Під впливом високої температури довкілля спостерігається почастішання дихання.",
                    },
                    {
                        h2: "Як правильно сидіти у сауні?",
                        img: "",
                        p: "Не слід сидіти, опустивши ноги вниз, і взагалі не допустимо перебувати в сауні в положенні стоячи, тому що можна отримати тепловий удар через температуру. Щоб всі частини тіла прогрілися рівномірно, потрібно змінювати позу – лежати то боці, то спині, потім животі.",
                    },
                    {
                        h2: "Що можна пити у сауні?",
                        img: "",
                        p: "Із собою у лазню можна взяти трав'яний чай, морс, квас, мінеральну воду без газу. Усі напої мають бути кімнатної температури, чай може бути гарячим чи теплим. Перед лазнею. Глибоке очищення організму від токсинів відбувається в парній російській лазні через потовиділення, якому допоможе склянку натурального квасу.",
                    },
                ],
            },
            {
                title: "Чан з крижаною криницею",
                img: IMAGES.BLOG.CHAN,
                content: [
                    {
                        h2: "Що таке чан?",
                        img: IMAGES.BLOG.CHAN,
                        p: "Гігантський чан наповнюється кришталево чистою водою з гірської річки чи джерел. Під ним розпалюють багаття на дровах, яке поступово нагріває воду. До води в чані додаються лікувальні карпатські трави, які насичують її додатковими позитивними властивостями. Після цього в теплу воду можна занурюватися.",
                    },
                    {
                        h2: "",
                        img: "",
                        p: "Чани мають позитивний вплив на шкірний покрив, зокрема чудово знімають запальні процеси, сприяють очищенню шкірних пір, поліпшенню тургору шкіри та зменшенню зморшкуватості. Гаряча вода сприяє підвищенню температури тіла та прискоренню метаболічних процесів, що у свою чергу призводить до виведення шлаків з організму та покращення самопочуття.",
                    },
                    {
                        h2: "",
                        img: IMAGES.GALLERY.GALLERY_3,
                        p: "В окремій будівлі, де розташовується чан, є зал для їди та активного дозвілля. Також тут можна відзначити урочисті події Вашого життя чи загальноприйняті свята, наприклад, Новий рік чи Різдво.",
                    },
                ],
            },
            {
                title: "Кадиба",
                img: IMAGES.GALLERY.GALLERY_1,
                content: [
                    {
                        h2: "Що ж таке кадиба?",
                        img: IMAGES.GALLERY.GALLERY_1,
                        p: "Це закрите приміщення з осередком, мангалом-барбекю, каміном, обладнаним димарем. Має форму шестикутника із невеликими вікнами. Тут Ви можете приготувати їжу на відкритому вогні та приємно провести час у теплій дружній компанії. Для тихих зимових вечорів важко придумати щось затишніше. Вечір у кадибі буде незабутнім і справді чарівним.",
                    },
                ],
            },
            {
                title: "Магазини в Микуличині",
                img: IMAGES.BLOG.SHOPING,
                content: [
                    {
                        h2: "Трохи про магазини Микуличина.",
                        img: IMAGES.BLOG.SHOPING,
                        p: "Микуличин - це кукрортне селище і звичайно ж у ньому є багато магазинів із сувенірами, продуктами харчування, господарськими товарами та іншими необхідними товарами для життя будь-якої людини. Найбільше скупчення магазинів розташовується в центрі селища, що приблизно знаходиться від садиби в межах 15 хвилин ходьби повільним кроком або 3-5 хвилин на машині. Але елементарні продукти Ви зможете купити за 100-200 метрів від проживання.",
                    },
                ],
            },
            {
                title: "Приготування їжі",
                img: IMAGES.BLOG.KITCHEN,
                content: [
                    {
                        h2: "Кухня.",
                        img: IMAGES.BLOG.KITCHEN,
                        p: "На території житлового комплексу, всередині будівлі, розташовується затишна, повністю обладнана необхідною для приготування їжі кухня. Тут є все від кухонного начиння до найсучаснішої електричної техніки. Ви можете готувати собі їжу в будь-який зручний для Вас час. Тут же у сусідньому приміщенні є їдальня приміщення зі столами та стільцями, де все приготовлене можна вжити.",
                    },
                ],
            },
            {
                title: "Вживання їжі",
                img: IMAGES.BLOG.CANTEEN,
                content: [
                    {
                        h2: "Їдальня.",
                        img: IMAGES.BLOG.CANTEEN,
                        p: "Якщо Ви не бажаєте стояти біля плити, а хочете постійно присвятити відпочинку, то персонал садиби із задоволенням зробить це для Вас за обумовленим меню. Ви зможете робити замовлення страв у зручний для Вас час з асортименту ресторану, який також належить готелю, але знаходиться в Яремчі. Вам все приготують і привезуть в обумовлений час.",
                    },
                ],
            },
            {
                title: "Розваги",
                img: IMAGES.BLOG.ENTERTAINMENT,
                content: [
                    {
                        h2: "Піші прогулянки по горах.",
                        img: IMAGES.BLOG.WALKS,
                        p: "Гора Ягідна (1216 м). До неї від зупинки автобуса веде лісова дорога: підйом нескладний, крутих ділянок практично не зустрічається, йти на вершину ґрунтовою дорогою близько 2-3 годин (залежно від погодних умов, стану дороги та особистого настрою мандрівників). До Ягідної з центру Микуличина – 7 км. З гори відкривається широка панорама на найвищий гірський хребет України – Чорногорський. На вершині Ягідної ви виявите дерев'яну альтанку: де буде відпочити і вдосталь налюбуватися гірськими пейзажами! Захопіть із собою бутерброди, термос та шоколадний батончик — чисте гірське повітря та двогодинний підйом обов'язково розбудять почуття голоду! Велика перевага цього простенького маршруту в тому, що його можна дозволити собі і влітку, і взимку: поблизу Ягідної є полонина Лиснів, там розташована гуцульська колиба з дров'яною піччю та широкими лежанками, а цього цілком достатньо для комфортного та безпечного ночівлі подалі від зручностей селища.", 
                    },
                    {
                        h2: "Покупки у Микуличині.",
                        img: IMAGES.BLOG.SHOPING,
                        p: `Новий торговий комплекс Hutsul Plaza (2020) розташований серед Карпатських гір, що поблизу Буковеля, на першій лінії від центральної дороги Яремче-Буковель. «Hutsul Plaza» – це 1000 м2, що поєднують сучасний стиль, вишуканість, трендові дизайнерські та ландшафтні рішення. Для відвідувачів комплексу «Hutsul Plaza» гарантуємо море позитивних емоцій від шопінгу, веселий настрій та чудовий час під час організації розважальних програм, святкувань, проведення ярмарків, конкурсів, дегустацій, фестивалів.`,
                    },
                    {
                        h2: "Церква Святої Трійці (1868 р.).",
                        img: IMAGES.BLOG.CHURCH,
                        p: "Церква Святої Трійці в Микуличині – пам'ятка архітектури національного значення (перебуває у розпорядженні Української греко-католицької церкви). Побудована просто в кращих карпатських традиціях дерев'яного зодчества, а за проектом королівського інженера-архітектора Чайковецького, чим і виділяється серед дерев'яних церков того періоду. Друга важлива деталь Троїцької церкви: у 1988 році тут було виявлено унікальну авторську роботу видатного художника Корнила Устияновича — оригінальну ікону священного мученика Йосафата, що знаходилася під новішим полотном. Вік оригіналу відноситься до кінця 19 ст. На сьогоднішній день Троїцька церква увінчує 5 дзвонів, найбільший з яких важить 6 центнерів (600 кг).",
                    },
                    {
                        h2: "Водоспад Женецький (Гук).",
                        img: IMAGES.BLOG.WATERFALL,
                        p: "Однокаскадний 15-метровий красень затишно розташувався в компанії смерекового лісу та кам'янистих Ґорґан. Знаходиться в заповідному урочищі Женець на однойменній річці. До Гука легко доїхати і навіть дійти. Це один з небагатьох карпатських водоспадів, до якого веде чудова асфальтована дорога. І нехай вона триває лише 3 км, а решта 3 км доведеться прогулятися класичною гірською ґрунтовкою злегка розмитою дощами та роз'їждженою автомобілями. Але шлях того вартий: Гук — високий і витончений: влітку не пересихає, а взимку вбирається вишуканими бурульками, тому будь-якої пори року ви не пошкодуєте, що прийшли сюди!",
                    },
                    {
                        h2: `Пивоварня "Мікуличин".`,
                        img: IMAGES.BLOG.BREWERY,
                        p: `Відкрита 2002 року пивоварня варить пиво натуральним способом, випускаючи його у продаж під торговою маркою “Гуцульське”. Не варто шукати великих бетонних споруд, звичних для ока городянина з промислових міст: у Микуличині пиво варять у невеликому дерев'яному будинку, де дивом розміщується ділянка пивоваріння та технічні відділи. Обладнання для виробництва пива поставили з Угорщини, а змонтували в класичній гуцульській хаті, яку на вигляд складно виділити з таких же будов навколо. За задумом власника, виробництво натурального пива має гармоніювати з навколишнім світом та культурою краю. Бродіння "Гуцульського" триває 7 днів і ще 14 днів пиво дозріває. Тут варять Медове та Темне, Світле “Ювілейне” та Біле “Гуцульське”. Мед, між іншим, для Медового пива одержують із власної пасіки. На територію броварні можна пройти з екскурсією, записатися на дегустацію пива та заглянути у фірмовий магазин за пінним трофеєм. Знайти магазин не проблема: у самому центрі Микуличина знаходиться невеликий, акуратненький будиночок з фірмовою вивіскою - повз не пройти і не проїхати!`,
                    },
                ],
            },
        ],
        footer: [ 
            {
                title: "Адреса:",
                text_1: "вул.Шкільна, 35",
                text_2: "61171, Микуличин",
                text_3: "Україна",
            },
            {
                title: "Телефони:",
                text_1: "+380637610748",
                text_2: "+380637610748",
                text_3: "+380637610748",
            },
        ],
    },

    ru: {
        //heder
        logoSite: `Усадьба  "У Якова"`,
        message: "Отправить сообщение",
        phone: "+3807610748",
        nav: [
            {text: "О нас", link: "/#about"},
            {text: "Номера", link: "/#numbers"},
            {text: "Галерея", link: "/#gallery"},
            {text: "Контакты", link: "/#contact"},
        ],
        service: [
            {
                src: ICONS.ROOM, 
                title: "Проживание", 
                text: "Комфортабельные 2-х местные номера класса 'Стандарт' и 'Полулюкс' с видом на горы.",
            },
            {
                src: ICONS.FOOD, 
                title: "Питание", 
                text: "Есть оборудованное всем необходимым помещение для приема и приготовления пищи.",
            },
            {
                src: ICONS.SAUNA, 
                title: "Сауна и чан", 
                text: "На территории отеля есть чан с душем и залом для приятного время припровождения.",
            },
        ],
        gallery: [
            {
                src: IMAGES.GALLERY.GALLERY_1, 
                title: "Кадыба для приготовления продуктов на открытом огне.",
            },
            {
                src: IMAGES.GALLERY.GALLERY_2, 
                title: "Экстерьер гостинницы со стороны прилегающей территории.",
            },
            {
                src: IMAGES.GALLERY.GALLERY_3, 
                title: "Зал для отдыха возле чана.",
            },
            {
                src: IMAGES.GALLERY.GALLERY_4, 
                title: "Типовой интерьер одного из номеров класса 'Стандарт'.",
            },
        ],
        aboutTitle: "Отдых в нашем отеле - гарантия хорошего настроения!",
        aboutText: "Отель расположен в долине в окружении красивейших гор. Горы покрыты густой растительностью и это гарантирует чистый целебный воздух. В шаговой доступности есть магазины с необходимыми на каждый день товарами и продуктами питания. В часе езды находится жемчужина украинских карпат - Буковель.",
        aboutImg: [
            {
                src: IMAGES.ABOUT.MYKULYCHYN, 
                title: "Прекрасный вид на Микуличин.",
            },
            {
                src: IMAGES.ABOUT.MYKULYCHYN_GERB, 
                title: "Герб Микуличина.",
            },
            {
                src: IMAGES.ABOUT.MYKULYCHYN_PRAPOR, 
                title: "Флаг Микуличина.",
            },
        ],
        review: [
            {
                title: "Отель прелестный.", 
                text: "Отель просто прелестный, чистый, стильный, современный и уютный. Есть все необходимое для хорошего отдыха.", 
                img: IMAGES.REVIEW.REVIEW_1, 
                auhtor: "Николай, Харьков",
            },
            {
                title: "Уютно и чисто.", 
                text: "Фото соответствуют. Очень уютно и чисто. Комната была маленькая, но к этому можно привыкнуть. Очень понравилось расположение.", 
                img: IMAGES.REVIEW.REVIEW_2, 
                auhtor: "Полина, Киев",
            },
            {
                title: "Комфортные номера.", 
                text: "Отличный, комфортный, чистый номер, удобная кровать и подушки, есть все необходимое! Было в радость провести время здесь.", 
                img: IMAGES.REVIEW.REVIEW_3, 
                auhtor: "Ярослав, Херсон",
            },
            {
                title: "Идеальное место.", 
                text: "Месторасположение идеальное у подножии гор! Осталась под впечатлением, будто побывала в гостях у своих родных!", 
                img: IMAGES.REVIEW.REVIEW_4, 
                auhtor: "Ольга, Винница",
            },
            {
                title: "Мы в восторге.", 
                text: "Мы в восторге, нам все очень понравилось. Проживание не в центре, а немного на окраине села, но лично для меня это плюс.", 
                img: IMAGES.REVIEW.REVIEW_5, 
                auhtor: "Светлана, Хмельницький",
            },
            {
                title: "Все нравится.", 
                text: "Отличное расположение, и номер с видом на горы. Прекрасно подходит для удаленной работы, хороший интернет и вкусная еда.", 
                img: IMAGES.REVIEW.REVIEW_6, 
                auhtor: "Виктория, Кировоград",
            },
            {
                title: "Приемлемые цены.", 
                text: "Чистота безукоризненная. Хорошее место расположение. Есть где поставить машину. Красивый вид из окна, рядом горы.", 
                img: IMAGES.REVIEW.REVIEW_7, 
                auhtor: "Геннадий, Чернигов",
            },
            {
                title: "Семейный отдых.", 
                text: "Красивый деревянный дом. Комнаты чистые, уютные, кровать удобная. Прекрасно оборудованная зона отдыха.", 
                img: IMAGES.REVIEW.REVIEW_8, 
                auhtor: "Ольга, Полтава",
            },
            {
                title: "Мы вернемся.", 
                text: "Очень удачное расположение к локациям. Поблизости есть горы, долина и река. Распологает к прогулкам. Хочется вернуться", 
                img: IMAGES.REVIEW.REVIEW_9, 
                auhtor: "Петр, Николаев",
            },
        ],
        
        numbersTitle: "Номера для проживания",
        numbersText: `«Усадьба У Якова» расположена в поселке Микуличин Ивано-Франковской области. В Микуличине удобно останавливаться если ваша цель — посмотреть Карпаты, так же здесь варят отличное пиво! Чистый воздух, красивейшая природа, множество пеших маршрутов по живописнейшим Карпатам, приемлемые цены на проживание и в пределах часовой доступности горнолыжные курорты Буковель и Яремче. Все это повод посетить Микуличин и нашу усадьбу.`,
        numbers: [
            {
                title: "Стандарт",
                img: IMAGES.NUMBERS.STANDART,
                icon: [
                    {
                      img: ICONS.APARTMENTS,
                      text: "Апартаменты",
                    },
                    {
                        img: ICONS.HIKING,
                        text: "Вид на горы",
                    },
                    {
                        img: ICONS.FOOD,
                        text: "Столовая и кухня",
                    },
                    {
                        img: ICONS.WI_FI,
                        text: "Бесплатный Wi-Fi",
                    },
                    {
                        img: ICONS.PARKING,
                        text: "Бесплатная парковка",
                    },
                ],
                description: `В номерах "Стандарт" имеется 2-х спальная кровать, телевизор со спутниковыми каналами, шкаф для вещей, 2 прикроватные тумбочки, журнальный столик с 2-мя пуфиками. Ванная комната,  туалет и холодильник расположены на этаже - 1 на 3 номера.`,
            },
            {
                title: "Полулюкс",
                img: IMAGES.NUMBERS.JUNIOR_SUITE,
                icon: [
                    {
                        img: ICONS.APARTMENTS,
                        text: "Апартаменты",
                    },
                    {
                        img: ICONS.HIKING,
                        text: "Вид на горы",
                    },
                    {
                        img: ICONS.FOOD,
                        text: "Столовая и кухня",
                    },
                    {
                        img: ICONS.WI_FI,
                        text: "Бесплатный Wi-Fi",
                    },
                    {
                        img: ICONS.PARKING,
                        text: "Бесплатная парковка",
                    },
                    {
                        img: ICONS.SHOWER,
                        text: "Собственная ванная комната",
                    },
                ],
                description: `В номерах "Полулюкс" имеется 2-х спальная кровать, телевизор со спутниковыми каналами, холодильник, шкаф для вещей, 2 прикроватные тумбочки, журнальный столик с 2-мя пуфиками и ванная комната с душем.`,
            },
        ],
        blog: [
            {
                title: "Природная красота Микуличина",
                img: IMAGES.CAROUSEL.CAROUSEL_2,
                content: [
                    {
                        h2: "Водопад Женецкий Гук",
                        img: IMAGES.BLOG.WATERFALL,
                        p: "Один из самых высоких карпатских водопадов – его высота 15 м, а сам он находится на высоте около 900 м над уровнем моря. От села Микуличин до водопада – 8 км, и чтобы добраться на него, надо сесть на любой рейсовый автобус и выйти перед поворотом на Гук. Далее дорогу укажут указатели. Перейдя железнодорожные пути вы увидите контрольно-пропускной пункт, где потребуется оплатить проход к водопаду (со взрослого около 10 грн, за ребенка – дешевле, за проезд автотранспорта взимается отдельная плата). Далее по асфальтовой дороге придется идти 1-1,5 часа, затем дорога сменится на грунтовку. Весь маршрут промаркирован, главное идти строго по указателям. Недалеко от водопада расположился сувенирный рынок, где можно купить карпатские травяные чаи, выпить глинтвейн или горячий кофе, что особенно приятно в холодную пору. У водопада есть беседки и скамейки, оборудованы смотровые площадки с лесенками и перилами, рядом находится небольшое кафе-колыба. Место пользуется популярностью у туристов в любое время года, поэтому ехать к водопаду желательно пораньше, чтобы успеть насладиться природой в тишине.",
                    },
                    {
                        h2: "Гора Костел.",
                        img: IMAGES.CAROUSEL.CAROUSEL_2,
                        p: "Pасположена в 4,5 км к востоку от Микуличина. Подъем можно начать от автомобильного моста через реку Прутец Чемиговский. Вершину горы венчает большая скала с плоским верхом в окружении более мелких камней. С нее открывается завораживающий вид на горные хребты Горганы, на Петрос и Говерлу.На гору можно подняться самостоятельно или заказать тур на внедорожнике практически до вершины (такие экскурсии предлагают в отелях и усадьбах).",
                    },
                    {
                        h2: "Гора Ягодная.",
                        img: "",
                        p: "Дорога, ведущая к ней, начинается прямо от автобусной остановки. Подъем несложный, без крутых участков. До вершины Ягодной идти часа 2-3, но это того стоит – с вершины открывается шикарный вид на Черногорский хребет. На вершине Ягодной есть беседка – можно отдохнуть, перекусить и вдоволь налюбоваться открывающимися пейзажами.",
                    },
                    {
                        h2: "Гора Маковица.",
                        img: "",
                        p: "То одна из самых высоких гор Яремче. Путь займет 1,5-2 часа. По центральной улице надо будет пройти в сторону улицы Горной и дальше в сторону Маковицы. На ее вершине стоит металлический крест, а при восхождении можно увидеть окопы и найти гильзы – следы минувших войн.",
                    },
                    {
                        h2: "Горы Хомяк и Синяк.",
                        img: "",
                        p: "Поход осилят и новички, и дети, так как перепад высот небольшой, а на дорогах нет особых препятствий. Один из маршрутов на г. Хомяк как раз пролегает по дороге к водопаду Женецкий Гук (надо повернуть налево от КПП и идти пешком еще 8 км, маршрут имеет красно-белую маркировку).",
                    },
                ],
            },
            {
                title: "Сауна с бодрящим бассейном",
                img: IMAGES.BLOG.SAUNAS,
                content: [
                    {
                        h2: "Чем полезно ходить в сауну?",
                        img: IMAGES.BLOG.SAUNAS,
                        p: "После пребывания в парной тонус мышц снижается. Тепловые воздействия снижают также напряжение в мышцах, смягчают соединительную ткань и делают мышцы более эластичными. Действие сауны на функцию внешнего дыхания. Под воздействием высокой температуры окружающей среды наблюдается учащение дыхания.",
                    },
                    {
                        h2: "Как правильно сидеть в сауне?",
                        img: "",
                        p: "Не следует сидеть, опустив ноги вниз, и вообще не допустимо находиться в сауне в положении стоя, так как можно получить тепловой удар из-за разности температур. Для того чтобы все части тела прогрелись равномерно, нужно менять позу – лежать то на боку, то на спине, потом на животе.",
                    },
                    {
                        h2: "Что можно пить в сауне?",
                        img: "",
                        p: "С собой в баню можно взять травяной чай, морс, квас, минеральную воду без газа. Все напитки должны быть комнатной температуры, чай может быть горячим или теплым. Перед баней. Глубокая очистка организма от токсинов происходит в парной русской бани через потоотделение, которому поможет стакан натурального кваса.",
                    },
                ],
            },
            {
                title: "Чан с ледяным колодцем",
                img: IMAGES.BLOG.CHAN,
                content: [
                    {
                        h2: "Что же такое чан?",
                        img: IMAGES.BLOG.CHAN,
                        p: "Гигантский чан наполняется кристально чистой водой с горной реки или источников. Под ним разжигают костер на дровах, который постепенно нагревает воду. К воде в чане добавляются лечебные карпатские травы, которые насыщают ее дополнительными положительными свойствами. После в теплую воду можно погружатся.",
                    },
                    {
                        h2: "",
                        img: "",
                        p: "Чаны оказывают положительное влияние на кожный покров, в частности прекрасно снимают воспалительные процессы, способствуют очищению кожных пор, улучшению тургора кожи и уменьшению морщинистости. Горячая вода способствует повышению температуры тела и ускорению метаболических процессов, что в свою очередь приводит, к выводу шлаков из организма и улучшения самочувствия.",
                    },
                    {
                        h2: "",
                        img: IMAGES.GALLERY.GALLERY_3,
                        p: "В отдельном здании, где располагается чан, есть зал для приема пищи и активного досуга. Также здесь можно отметить торжественные события Вашей жизни или общепринятые праздники, например, Новый год или Рождество.",
                    },
                ],
            },
            {
                title: "Кадыба",
                img: IMAGES.GALLERY.GALLERY_1,
                content: [
                    {
                        h2: "Что же такое кадыба?",
                        img: IMAGES.GALLERY.GALLERY_1,
                        p: "Это закрытое помещение с очагом, мангалом-барбекю, камином, оборудованным дымоходом. Имеет форму шестиугольника с небольшими окнами. Здесь Вы можете приготовить пищу на открытом огне и приятно провести время в теплой дружеской компании. Для тихих зимних вечеров трудно придумать что-либо уютнее. Вечер в кадыбе будет незабываемым и по настоящему волшебным.",
                    },
                ],
            },
            {
                title: "Магазины в Микуличине",
                img: IMAGES.BLOG.SHOPING,
                content: [
                    {
                        h2: "Немного о магазинах Микуличина",
                        img: IMAGES.BLOG.SHOPING,
                        p: "Микуличин - это кукрортный поселок и конечно же в нем есть много магазинов с сувенирами, продуктами питания, хозяйственными товарами и другими необходимыми товарами для жизни любого человека. Самое большое скопление магазинов располагается в центре поселка, что примерно находится от усадьбы в пределах 15 минут ходьбы неспешным шагом или 3-5 минут на машине. Но элементарные продукты Вы сможете купить в 100-200 метрах от проживания.",
                    },
                ],
            },
            {
                title: "Приготовление пищи",
                img: IMAGES.BLOG.KITCHEN,
                content: [
                    {
                        h2: "Кухня",
                        img: IMAGES.BLOG.KITCHEN,
                        p: "На территории жилого комплекса, внутри здания располагается уютная, полностью оборудованная необходимой для приготовления пищи кухня. Здесь есть все от кухонной утвари до самой современной электрической техники. Вы можете готовить себе еду в любое удобное для Вас время. Здесь же в соседнем помещении есть столове помещение со столами и стульями, где все приготовленное можно употребить.",
                    },
                ],
            },
            {
                title: "Прием пищи",
                img: IMAGES.BLOG.CANTEEN,
                content: [
                    {
                        h2: "Столовая",
                        img: IMAGES.BLOG.CANTEEN,
                        p: "Если Вы не желаете стоять у плиты, а хотите все свое время посвятить отдыху, то персонал усадьбы с удовольствием сделает это для Вас по оговоренному меню. Вы сможете делать заказ блюд в удобное для Вас время из ассортимента ресторана, который также принадлежит отелю, но располагается в соседнем Яремче. Вам все приготовят и привезут в оговоренное время.",
                    },
                ],
            },
            {
                title: "Развлечения",
                img: IMAGES.BLOG.ENTERTAINMENT,
                content: [
                    {
                        h2: "Пешие прогулки по горам.",
                        img: IMAGES.BLOG.WALKS,
                        p: "Гора Ягодная (1 216 м). К ней от остановки автобуса ведет лесная дорога: подъём несложный, крутых участков практически не встречается, идти на вершину по грунтовой дороге около 2-3 часов (зависимо от погодных условий, состояния дороги и личного настроения путешественников). До Ягодной из центра Микуличина - 7 км. С горы открывается широкая панорама на самый высокий горный хребет Украины — Черногорский. На вершине Ягодной вы обнаружите деревянную беседку: будет где отдохнуть и вдоволь налюбоваться горными пейзажами! Захватите с собой бутерброды, термос и шоколадный батончик — чистый горный воздух и двухчасовой подъём обязательно разбудят чувство голода! Большое преимущество этого простенького маршрута в том, что его можно позволить себе и летом, и зимой: поблизости Ягодной есть полонина Лиснив, там расположена гуцульская колыба с дровяной печью и широкими лежанками, а этого вполне достаточно для комфортной и безопасной ночевки вдали от удобств поселка.", 
                    },
                    {
                        h2: "Покупки в Микуличине.",
                        img: IMAGES.BLOG.SHOPING,
                        p: `Новый торговый комплекс Hutsul Plaza (2020) расположен среди Карпатских гор, близ Буковеля, на первой линии от центральной дороги Яремче-Буковель. «Hutsul Plaza» – это 1000 м2, сочетающих современный стиль, изысканность, трендовые дизайнерские и ландшафтные решения. Для посетителей комплекса «Hutsul Plaza» гарантируем море положительных эмоций от шопинга, веселое настроение и отличное время во время организации развлекательных программ, празднований, проведения ярмарк, конкурсов, дегустаций, фестивалей.`,
                    },
                    {
                        h2: "Церковь Святой Троицы (1868 г.).",
                        img: IMAGES.BLOG.CHURCH,
                        p: "Церковь Святой Троицы в Микуличине — памятник архитектуры национального значения (находится в распоряжении Украинской греко-католической церкви). Построена на просто в лучших карпатских традициях деревянного зодчества, а по проекту королевского инженера-архитектора Чайковецкого, чем и выделяется среди деревянных церквушек того периода. Вторая важная деталь Троицкой церкви: в 1988 году здесь была обнаружена уникальная авторская работа выдающегося художника Корнила Устияновича — оригинальная икона священно мученика Иосафата, находившаяся под более новым полотном. Возраст оригинала относится к концу 19 века. На сегодняшний день Троицкая церковь венчает 5 колоколов, самый большой из которых весит 6 центнеров (600 кг).",
                    },
                    {
                        h2: "Водопад Женецкий (Гук).",
                        img: IMAGES.BLOG.WATERFALL,
                        p: "Однокаскадный 15-метровый красавец уютно расположился в компании смерекового леса и каменистых Горган. Находится в заповедном урочище Женец на одноименной реке. До Гука легко доехать и даже дойти. Это один из немногих карпатских водопадов к которому ведет отличная асфальтированная дорога. И пусть она длится только 3 км, а остальные 3 км придется прогуляться классической горной грунтовкой слегка размытой дождями и разъезженной автомобилями. Но путь того стоит: Гук — высокий и утонченный: летом не пересыхает, а зимой наряжается изысканными сосульками, поэтому в любую пору года вы не пожалеете, что пришли сюда!",
                    },
                    {
                        h2: `Пивоварня “Микуличин”.`,
                        img: IMAGES.BLOG.BREWERY,
                        p: `Открытая в 2002 году пивоварня варит пиво натуральным способом, выпуская его в продажу под торговой маркой “Гуцульское”. Не стоит искать больших бетонных сооружений, привычных для глаза горожанина из промышленных городов: в Микуличине пиво варят в небольшом деревянном доме, где чудом размещается участок пивоварения и технические отделы. Оборудование для производства пива поставили из Венгрии, а смонтировали в классической гуцульской хате, которую по внешнему виду сложно выделить из таких же строений вокруг. По задумке владельца, производство натурального пива должно гармонировать с окружающим миром и культурой края. Брожение “Гуцульского” продолжается 7 дней и ещё 14 дней пиво дозревает. Тут варят Медовое и Темное, Светлое “Юбилейное” и Белое “Гуцульское”. Мед, между прочим, для Медового пива получают с собственной пасеки. На территорию пивоварни можно пройти с экскурсией, записаться на дегустацию пива и заглянуть в фирменный магазин за пенным трофеем. Найти магазин не проблема: в самом центре Микуличина находится небольшой, аккуратненький домик с фирменной вывеской — мимо не пройти и не проехать!`,
                    },
                ],
            },
        ],
        footer: [ 
            {
                title: "Адрес:",
                text_1: "ул.Школьная, 35",
                text_2: "61171, Микуличин",
                text_3: "Украина",
            },
            {
                title: "Телефоны:",
                text_1: "+380637610748",
                text_2: "+380637610748",
                text_3: "+380637610748",
            },
        ],
    },

    //размер экрана для мобильных настроек
    global: {
      SCREENWIDTH: 767,
    },

    //социальные сети
    // socialUrl: [
    //   {url: 'https://www.facebook.com/groups/ali.ukraine', img: assets.ICONS.FACEBOOK,},
    //   {url: 'https://www.instagram.com/ali.in.ua/', img: assets.ICONS.INSTAGRAM,},
    //   {url: 'https://twitter.com/UaAliexpress', img: assets.ICONS.TWITTER,},
    //   {url: 'https://www.youtube.com/channel/UCwvoDgJjnDOYcKvZ2DQJ_aQ', img: assets.ICONS.YOUTUBE,},
    //   {url: 'https://www.tiktok.com/@ali.in.ua', img: assets.ICONS.TIKTOK,},
    //   {url: 'https://www.reddit.com/user/SWSCompany', img: assets.ICONS.REDDIT,},
    // ],
  };

export default Store;